wisteria-1c/Конфигурация/ExchangePlans/СОтборами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ExchangePlan>
		<Properties>
			<Name>СОтборами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоСкладамИМагазинам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизироватьТокеныАвторизацииИСМП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СкладыИМагазины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

wisteria-1c/Конфигурация/ExchangePlans/СОтборами/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет настройки, влияющие на использование плана обмена.
// 
// Параметры:
//  Настройки - Структура - настройки плана обмена по умолчанию, см. ОбменДаннымиСервер.НастройкиПланаОбменаПоУмолчанию,
//                          описание возвращаемого значения функции.
//
Процедура ПриПолученииНастроек(Настройки) Экспорт

	Настройки.НазначениеПланаОбмена = "РИБСФильтром";
	Настройки.Алгоритмы.ОписаниеОграниченийПередачиДанных = Истина;
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки = Истина;

КонецПроцедуры

// Заполняет набор параметров, определяющих вариант настройки обмена.
// 
// Параметры:
//  ОписаниеВарианта       - Структура - набор варианта настройки по умолчанию,
//                                       см. ОбменДаннымиСервер.ОписаниеВариантаНастройкиОбменаПоУмолчанию,
//                                       описание возвращаемого значения.
//  ИдентификаторНастройки - Строка    - идентификатор варианта настройки обмена.
//  ПараметрыКонтекста     - Структура - см. ОбменДаннымиСервер.ПараметрыКонтекстаПолученияОписанияВариантаНастройки,
//                                       описание возвращаемого значения функции.
//
Процедура ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста) Экспорт

	ОписаниеВарианта.ЗаголовокКомандыДляСозданияНовогоОбменаДанными = НСтр(
		"ru = 'Удаленное рабочее место с отборами (РИБ с фильтрами)'");
	ОписаниеВарианта.ИмяФайлаНастроекДляПриемника = НСтр("ru = 'Настройки обмена удаленное рабочего места'");
	ОписаниеВарианта.ИспользуемыеТранспортыСообщенийОбмена = ИспользуемыеТранспортыСообщенийОбмена();
	ОписаниеВарианта.ИмяФормыСозданияНачальногоОбраза = "ОбщаяФорма.СозданиеНачальногоОбразаСФайлами";
	ОписаниеВарианта.ИспользоватьПомощникСозданияОбменаДанными = Истина;
	ОписаниеВарианта.Отборы = ОбменДаннымиУНФ.НастройкаОтборовНаУзле();
	ОписаниеВарианта.КраткаяИнформацияПоОбмену = НСтр(
		"ru = 'Позволяет настроить новый узел распределенной информационной базы с отборами по организации, складам и магазинам.'");
	ОписаниеВарианта.ПодробнаяИнформацияПоОбмену = "ПланОбмена.СОтборами.Форма.ПодробнаяИнформация";
	ОписаниеВарианта.ОбщиеДанныеУзлов = ОбменДаннымиУНФ.ОбщиеДанныеУзлов();

КонецПроцедуры

// Возвращает строку описания ограничений миграции данных для пользователя;
// Прикладной разработчик на основе установленных отборов на узле должен сформировать строку описания ограничений 
// удобную для восприятия пользователем.
// 
// Параметры:
//  НастройкаОтборовНаУзле - Структура - структура отборов на узле плана обмена,
//                                       полученная при помощи функции НастройкаОтборовНаУзле().
//  ВерсияКорреспондента - Строка - Номер версии корреспондента.
//  ИдентификаторНастройки - Строка - Идентификатор варианта настройки, для которого формируется описание
// 
// Возвращаемое значение:
//  Строка - строка описания ограничений миграции данных для пользователя
//
Функция ОписаниеОграниченийПередачиДанных(НастройкаОтборовНаУзле, ВерсияКорреспондента, ИдентификаторНастройки) Экспорт

	Если НастройкаОтборовНаУзле.Организации.Организация.Количество() > 0 Тогда
		СтрокаПредставленияОтбора = СтрСоединить(НастройкаОтборовНаУзле.Организации.Организация, ", ");
		ШаблонТолькоПоОрганизациям = НСтр("ru = 'Только по организациям: %1'");
		ОграничениеОтборПоОрганизациям = СтрШаблон(ШаблонТолькоПоОрганизациям, СтрокаПредставленияОтбора);
		Возврат ОграничениеОтборПоОрганизациям;
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//  Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//           где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы,
//           связанного с реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("Код");
	Результат.Добавить("НомерПринятого");
	Результат.Добавить("НомерОтправленного");

	Возврат Результат;

КонецФункции

Функция ИспользуемыеТранспортыСообщенийОбмена()
    
	Результат = Новый Массив;
	Результат.Добавить(Обработки.ТранспортСообщенийОбменаCOM);
	Результат.Добавить(Обработки.ТранспортСообщенийОбменаWS);
	Результат.Добавить(Обработки.ТранспортСообщенийОбменаFILE);
	Результат.Добавить(Обработки.ТранспортСообщенийОбменаFTP);
	Результат.Добавить(Обработки.ТранспортСообщенийОбменаEMAIL);
	Результат.Добавить(Обработки.ТранспортСообщенийОбменаПассивныйРежим);
    
    Возврат Результат;
    
КонецФункции

#КонецОбласти

#КонецЕсли
